Mod.org
#+TITLE: Quarks System Core (v.1.0.0) Annotated Source
#+AUTHOR: Chatman R. Jr
#+PROPERTY: header-args :mkdirp yes

* Table of Contents :TOC@4:
- [[#introduction][Introduction]]
- [[#overview-of-system-design][Overview of System Design]]
- [[#formatters][Formatters]]
  - [[#css-formats][CSS Formats]]
    - [[#custom-properties][Custom Properties]]
    - [[#sass-scsslessstylus][Sass (SCSS)/Less/Stylus]]
  - [[#data-exports][Data Exports]]
  - [[#desktop-support][Desktop Support]]
  - [[#helpers][Helpers]]
    - [[#css-format-structure][CSS Format Structure]]
    - [[#undefined-project-metadata-error][Undefined Project Metadata Error]]
    - [[#metadata-emitter][Metadata Emitter]]
    - [[#token-string-constructor][Token String Constructor]]
    - [[#css-token-emitter][CSS Token Emitter]]
    - [[#css-token-assembler][CSS Token Assembler]]
    - [[#token-string-identifier][Token String Identifier]]
    - [[#automatic-versioning][Automatic Versioning]]
    - [[#timestamp-emitter][Timestamp Emitter]]
    - [[#yaml-assemblers][YAML Assemblers]]
- [[#utilities][Utilities]]
- [[#internals][Internals]]
  - [[#functional-programming][Functional Programming]]
    - [[#currying][Currying]]
    - [[#composition][Composition]]
    - [[#pipelining][Pipelining]]
  - [[#error-handling][Error Handling]]
- [[#data][Data]]
    - [[#named-color-keywords][Named Color Keywords]]
    - [[#colors-project-web-defaults][Colors Project Web Defaults]]
    - [[#system-font-stacks][System Font Stacks]]

* Introduction

Quarks System Core is written as a literate program in a top-down structure. Following this document
requires you understand the core concepts of the library, so I'll introduce those first.

You can access the test suite from =index.html=.

* Overview of System Design

From output to the  lowest level math, the system design is as follows:

+ Formatters: format a custom or bootstrapped Quarks System Dictionary as a file-ready set of design
  tokens for the web or other environmennts
+ Bootstrappers: outputs a complete dictionary from a configuration object
+ Transformers: convert entire Quarks System Dictionaries to other data formats (especially for interop)
+ Quarks System Dictionary: standard data schema consumed by transformers, returned by
  bootstrappers, and formatted by emitters
+ Formulas: features that represent data boilerplatesfor a bootstrapped or custom Quarks System Dictionary
+ Configurations: generic abstractions intended to streamline the assembly of formulas
+ Utilities: the functional toolbox used to create the higher abstractions
+ Internals: lower level utilities and helpers inaccessible to the user
+ Data: Hardcoded objects needed by some utilities

My hope is that this explicit outlining of the design will aid you in advanced use and extension of
Quarks System Core. Now, let's dive in.

* Formatters
:PROPERTIES:
:header-args:js: :tangle "./formatters.js" :comments link
:END:

At the top layer sit the formatters. Their only purpose is to format Quarks System Dictionaries into
file-ready design tokens. The available targets are named by their file extensions and include:

=css=: CSS custom properties
=scss/less/styl=: Variables for the respective preprocessor
=raw/yaml=: exports the raw dictionary (as JSON or YAML)
=gpl=: extracts the color dictionary for use in GIMP/Inkscape
=sketchpalette=: extracts the color dictionary as a Sketch palette

All of the formatters will /refuse/ to process a QSD that doesn't include =project= metadata. *This is by
design* as formatters are endpoints. The project metadata indicates that a dictionary needs no
additional processing and is ready for output.

The console will helpfully yell an error at you if you forget.

Crucial to note: Quarks System Core *assumes no read/write access* to your filesystem. The formatters
merely prepare your tokens for passalong to the filesystem library of your choice or your
environment's native filesystem API.

** CSS Formats

*** Custom Properties

Quarks System Core provides the most complete support for its CSS formats by virtue of being a
web-driven, web-focused kit. The first formatter preps your design tokens as CSS custom
properties wrapped in a root selector.

#+BEGIN_SRC js
export function css(dict) {
  return cssFormatStructure({}, dict);
}
#+END_SRC

*** Sass (SCSS)/Less/Stylus

The preprocessor formats require some minor adjustments.

#+BEGIN_SRC js
export function scss(dict) {
  return cssFormatStructure(
    {
      doc: ["\n/*!", " */\n"],
      metadata: ["", "// ", "\n\n"],
      wrapper: ["", "\n"],
      opts: { padding: "", prefix: "$" },
    },
    dict,
  );
}
#+END_SRC

#+BEGIN_SRC js
export function less(dict) {
  return cssFormatStructure(
    {
      doc: ["\n/*", " */\n"],
      metadata: ["", "// ", "\n\n"],
      wrapper: ["", "\n"],
      opts: { padding: "", prefix: "@" },
    },
    dict,
  );
}
#+END_SRC

#+BEGIN_SRC js
export function styl(dict) {
  return cssFormatStructure(
    {
      doc: ["\n/*!", " */\n"],
      metadata: ["", "// ", "\n\n"],
      wrapper: ["", "\n"],
      opts: { padding: "", prefix: "", assignment: " = ", suffix: "" },
    },
    dict,
  );
}
#+END_SRC

** Data Exports

Quarks System Core also allows direct data export to JSON and YAML for maximum portability.

#+BEGIN_SRC js
export function raw(dict) {
  const { project, ...tokens } = dict;
  const { bump = "manual" } = project || MissingProjectMetadataError();

  // Check if bump matches an automation keyword
  const autobump = ["major", "minor", "patch", "pre", "build"].some(
    (keyword) => keyword === bump,
  );

  // Then bump the version
  autobump && bumpVersion(project);

  return JSON.stringify({ project, tokens }, null, 2);
}
#+END_SRC

#+BEGIN_SRC js
export function yaml(dict) {
  const { project, ...tokens } = dict;
  const { bump = "manual" } = project || MissingProjectMetadataError();

  // Check if bump matches an automation keyword
  const autobump = ["major", "minor", "patch", "pre", "build"].some(
    (keyword) => keyword === bump,
  );

  // Then bump the version
  autobump && bumpVersion(project);

  const assemble = (level, tree) =>
    Object.entries(tree).reduce((str, [key, data]) => {
      if (typeof data === "string") return yamlDictValue(level, str, key, data);
      if (Array.isArray(data)) return yamlDictScale(level, str, key, data);
      if (key === "base") return yamlDictSubcategory(level, data);
      return str.concat(
        "".padStart(level),
        key,
        ":\n",
        assemble(level + 2, data),
      );
    }, "");

  return `
# ${timestampEmitter()}
${
    Object.entries({ project, tokens })
      .reduce((str, [key, data]) => {
        if (typeof data === "string") return yamlDictValue(0, str, key, data);
        if (Array.isArray(data)) return yamlDictScale(0, str, key, data);
        if (key === "base") return yamlDictSubcategory(0, data);
        return str.concat("\n", key, ":\n", assemble(2, data));
      }, "")
      .trimEnd()
  }
`;
}
#+END_SRC

** Desktop Support

Quarks System Core supports GIMP/Inkscape and Sketch palette formatting as of v1. The Inkscape
support was added because I occasionally create logos for stuff, and Sketch was added because it's
a popular app and I didn't realize the Sketch palette plugin schema was so light.

There are several reasons I won't support Adobe apps, but this isn't the place for that.

** Helpers

*** CSS Format Structure

The differences between the CSS formatters are trivial, so I abstracted the similarities into the
below helper function.

#+BEGIN_SRC js
function cssFormatStructure(
  {
    doc: [DOC_OPEN, DOC_CLOSE] = ["\n/**", " **/\n"],
    metadata: [OPEN, DELIM, CLOSE] = ["\n  /**", "   * ", "\n   **/\n\n"],
    wrapper: [TOKENS_OPEN, TOKENS_CLOSE] = ["\n:root {", "\n}\n"],
    opts = { padding: "  " },
  } = {},
  { project, ...tokens },
) {
  let {
    name,
    author,
    version,
    license,
    bump = "manual",
    metadata: { description = "N/A", comments = "N/A" } = {},
  } = project || MissingProjectMetadataError(project);

  // Attach a dynamic property initializing the autorelease version
  const autobump = ["major", "minor", "patch", "pre", "build"].some(
    (keyword) => keyword === bump,
  );

  return "".concat(
    DOC_OPEN,
    `
 * Project: ${name} (v${autobump ? bumpVersion(project) : version})
 * Owned by: ${author}
 * License: ${license}
 * ${"=".repeat(64)}
${
      metadataEmitter(
        { commentDelim: [" *", " * ", ""] },
        {
          description,
          comments,
        },
      )
    }
 * ${"-".repeat(64)}
 * ${timestampEmitter()}
`,
    DOC_CLOSE,
    TOKENS_OPEN,
    tokenStringConstructor(
      { ...opts, commentDelim: [OPEN, DELIM, CLOSE] },
      tokens,
    ),
    TOKENS_CLOSE,
  );
}
#+END_SRC

*** Undefined Project Metadata Error

A handy error to throw when the Quarks System Dictionary passed in to the formatters is
/incomplete/. As I stated further up, the formatters will not process any dictionary that's missing
project metadata.

#+BEGIN_SRC js
function MissingProjectMetadataError() {
  throw new QSCError({
    name: "Missing Project Metadata",
    reason: `
Formatters will not process a Quarks System Dictionary that's missing project
metadata. Its absence indicates that the current dictionary is still open
for modification.
`,
    suggestion: `
Be sure to include project metadata when you're ready to export your tokens.
Here's an example of the proper schema.

const finishedDict = {
  project: {
    name: "My Project",
    author: "Anonymous",
    version: "0.0.0",
    license: "Unlicense",
    // OPTIONAL can also be one of "major", "minor", "patch", "pre", "build" for automatic versioning
    bump: "manual",
    // OPTIONAL
    metadata: {
      description: "N/A",
      comments: "N/A"
    }
  },
  ...tokens
};

The first four properties are all required. Up to you if you want to include
a description or comments with your project.
`,
  });
}
#+END_SRC

