Mod.org
*** Metadata Emitter

This helper provides a convenient way to assemble metadata as a comment block or line depending on
the format. It's used for both dictionary metadata and project metadata.

#+BEGIN_SRC js
function metadataEmitter(
  {
    commentDelim: [OPEN, DELIM, CLOSE] = ["\n  /**", "   * ", "\n   **/\n\n"],
    str = "",
  },
  meta,
) {
  return str.concat(
    [
      OPEN,
      Object.entries(meta).reduce((str, [key, value]) => {
        const lines = value.split("\n");

        if (lines.length > 1) {
          return str
            .concat(
              "\n",
              DELIM,
              key.toUpperCase(),
              ":",
              "\n",
              DELIM.trimEnd(),
              lines.join(`\n${DELIM}`),
            )
            .trimEnd();
        }

        return str.concat("\n", DELIM, key.toUpperCase(), ": ", lines);
      }, ""),
      CLOSE,
    ].join(""),
  );
}
#+END_SRC

*** Token String Constructor

The following construction helper is shared by all formatters in which the token identifier must be
created by traversing the dictionary. It uses recursion to walk branch by branch, combining keys with
a given delimiter until it reaches the end of the chain.

If it finds internal metadata, it will use a special function to process it

#+BEGIN_SRC js
function tokenStringConstructor(opts, dict) {
  return "".concat("\n", cssTokenEmitter(opts, "", dict));
}
#+END_SRC

*** CSS Token Emitter

This helper is responsible for actually walking the tree and emitting a complete collection of
tokens; formatting metadata as it finds it.

#+BEGIN_SRC js
function cssTokenEmitter(opts, head, node) {
  function assemble(head, node) {
    const { metadata, ...tokens } = node;
    return "".concat(
      (metadata && metadataEmitter(opts, metadata)) || "", // prepend metadata if defined
      Object.entries(tokens).reduce((str, [key, value]) => {
        const format = cssTokenAssembler(opts);
        if (typeof value === "object") {
          return str.concat(
            assemble(tokenStringIdentifier(head, key, "-"), value),
          );
        }

        return format(str, tokenStringIdentifier(head, key, "-"), value, "\n");
      }, ""),
    );
  }

  return assemble(head, node);
}
#+END_SRC

*** CSS Token Assembler

This helper is responsible for creating a string that the target format will actually recognize as a
variable or identifier.

#+BEGIN_SRC js
function cssTokenAssembler({
  padding = "",
  prefix = "--",
  assignment = ": ",
  suffix = ";",
  terminator = "\n",
}) {
  return function (str, key, value) {
    return str.concat(
      padding,
      prefix,
      key,
      assignment,
      value,
      suffix,
      terminator,
    );
  };
}
#+END_SRC

*** Token String Identifier

This helper is used when =*TokenEmitter= functions walk through the dictionary. It collects the
keys and joins them with a delimiter. However, it also /ignores/ any keys named base. Simply passing
through what it's already collected.

So =color.main.base= becomes =--color-main= in CSS for example.

#+BEGIN_SRC js
function tokenStringIdentifier(collected, current, delimiter) {
  return current === "base"
    ? collected
    : collected
    ? [collected, current].join(delimiter)
    : current;
}
#+END_SRC

*** Automatic Versioning

The following helper handles automatic versioning whenever project metadata defines =bump= as a
keyword other than ="manual"=.

#+BEGIN_SRC js
function bumpVersion(project) {
  let [major, minor, patch, pre] = Array.from(
    project.version.split(/[.-]/g),
  ).map((n) => parseFloat(n));

  function next(keyword) {
    const bumped = new Map([
      ["major", [major + 1, 0, 0]],
      ["minor", [major, minor + 1, 0]],
      ["patch", [major, minor, patch + 1]],
      ["pre", [major, minor, patch, pre + 1 || 0]],
      ["build", [major, minor, patch, pre, Date.now()]],
    ]).get(keyword);

    return bumped;
  }

  const releaseConditions = (release) =>
    Array.from(
      new Map([
        [release.length === 3, release.join(".")],
        [
          release.length === 4,
          [release.slice(0, 3).join("."), release[3]].join("-"),
        ],
        [
          release.length === 5,
          [
            release.slice(0, 3).join("."),
            [release[3] ?? 0, release[4]].join("+"),
          ].join("-"),
        ],
      ]),
    )
      .filter(([condition]) => condition)
      .flatMap(([, release]) => release)
      .toString();

  project["version"] = releaseConditions(next(project.bump));

  return project.version;
}
#+END_SRC

*** Timestamp Emitter

#+BEGIN_SRC js
function timestampEmitter() {
  const TIMESTAMP = new Date(Date.now());
  return `Updated on ${TIMESTAMP.toLocaleDateString()} at ${TIMESTAMP.toLocaleTimeString()}`;
}
#+END_SRC

*** YAML Assemblers

The following helpers format YAML by the three main structures of the Quarks System Dictionary
schema: values, scales, and subcategories. The value function helpfully handles the multiline
metadata strings as well.

#+BEGIN_SRC js
function yamlDictSubcategory(level, data) {
  return Object.entries(data).reduce((str, [key, v]) => {
    if (Array.isArray(v)) return yamlDictScale(level, str, key, v);
    return yamlDictValue(level, str, key, v);
  }, "");
}

function yamlDictValue(level, str, key, value) {
  const isMultiline = value.split("\n").length > 1;
  if (isMultiline) {
    return str.concat(
      "".padStart(level),
      `${key}: |\n`,
      value
        .split("\n")
        .reduce((s, line) => s.concat("".padStart(level + 2), line, "\n"), ""),
    );
  }
  return str.concat("".padStart(level), key, ": ", value, "\n");
}

function yamlDictScale(level, str, key, value) {
  return str.concat(
    "".padStart(level),
    key,
    ":\n",
    value.reduce((s, v) => s.concat("".padStart(level + 2), "- ", v, "\n"), ""),
  );
}
#+END_SRC

* Utilities
:PROPERTIES:
:header-args:js: :tangle "./utilities.js" :comments link
:END:
* Internals
:PROPERTIES:
:header-args:js: :tangle "./internals.js" :comments link
:END:
** Functional Programming

My first set of internals are used throughout the codebase and contribute to its
composable and expressive design.

*** Currying

Currying is a powerful higher-order transformation where a function of =n= arguments is morphed into
a sequence of calls with one argument. So this: =fn(z, y, x)= becomes =fn(z)(y)(x)=.

This utility really shines in a data-last architectures like this project. Since the final argument
is /always/ data, currying allows you to preload its modifiers and leave the data operation =fn(x)=
for composition and pipelining.

The implementation is an advanced curry that allows partial application and uncurried functionality.

#+BEGIN_SRC js
export function curry(fn) {
  return (...initial) =>
    initial.length >= fn.length
      ? fn.apply(this, initial)
      : (...remaining) => fn.apply(this, initial.concat(remaining));
}
#+END_SRC

*** Composition

Functional composition is a higher-order operation that combines functions in sequence into a brand
new function queued for data. It's an excellent way to reuse tiny utilities for more complex
behavior.

Currying and composition are the chocolate and caramel of Quarks System Core.

#+BEGIN_SRC js
export function compose(...fns) {
  return (x) => fns.reduce((g, f) => f(g), x);
}
#+END_SRC

*** Pipelining

Pipelining is a powerful pattern that drives this project, because its main purpose is to generate
and manipulate data. Excepting the error handlers and formatters, data is *both the input and output*
of every function.

As the name implies, pipelining is a higher-order function where data is transformed by being piped
through a series of data operations. These operations can themselves include compositions and
pipelines.

Another way to think of it: composition combines data /operations/, pipelining applies data
/transformations/.

#+BEGIN_SRC js
function pipe(x, ...fns) {
  return compose(...fns)(x);
}
#+END_SRC

** Error Handling

For v1, I wanted to create better custom errors. So I decided to directly extend the =Error= class
with my own general =QSCError= class. This will allow me to throw any number of errors I need
/within/ the context they're triggered and gives me a free stack trace back to what broke.

#+BEGIN_SRC js
class QSCError extends Error {
  constructor({
    name = "Unknown Error",
    reason = "here's why",
    suggestion = "try this",
  } = {}) {
    super();
    this.name = name;
    this.message = `
${reason}
${suggestion}
${"=".repeat(80)}
`;
  }
}
#+END_SRC

* Data
:PROPERTIES:
:header-args:js: :tangle "./data.js"
:END:

At the bottom rung sits collections of hardcoded data required for processing named color keywords,
Colors project defined web defaults, and system font stacks.

